code-review/NRB_3471_3546/База_Было/InformationRegisters/АдресныйКлассификатор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АдресныйКлассификатор</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>52</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АльтернативныеНазвания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипАдресногоЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодРегионаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодРайонаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодГородаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодНаселенногоПунктаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодУлицыВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/АдресныйКлассификатор/Forms/ФормаЗагрузкиАдресногоКлассификатора/Ext/Form/Module.bsl
&НаКлиенте
Перем ПараметрыОбработчикаОжидания, ФормаДлительнойОперации;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ И ЭЛЕМЕНТОВ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокРегионов();
 	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОформлениеФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеФормы()
	
	Элементы.ФайлКлассификатораДомов.Доступность = Формат2003;
	
	Если Не Формат2003 Тогда  		
		Элементы.ФайлКлассификатораДомов.ЦветТекстаЗаголовка = WebЦвета.Серый; 
	Иначе
		Элементы.ФайлКлассификатораДомов.ЦветТекстаЗаголовка = ЦветаСтиля.ЦветТекстаФормы;
	КонецЕсли;	
	
КонецПроцедуры	


// Процедура - обработчик события "НачалоВыбора" поля ввода "ФайлАдресногоКлассификатора".
//        
&НаКлиенте
Процедура ФайлАдресногоКлассификатораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ВводФайлаАдресногоКлассификатора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВводФайлаАдресногоКлассификатора.Фильтр = "Файл базы данных(*.dbf)|*.dbf";
	ВводФайлаАдресногоКлассификатора.ПроверятьСуществованиеФайла = Истина;
	Если ВводФайлаАдресногоКлассификатора.Выбрать() Тогда
		ФайлАдресногоКлассификатора = ВводФайлаАдресногоКлассификатора.ПолноеИмяФайла;
	КонецЕсли

КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля ввода "ФайлКлассификатораУлиц".
// 
&НаКлиенте
Процедура ФайлКлассификатораУлицНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ВводФайлаКлассификатораУлиц = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВводФайлаКлассификатораУлиц.Фильтр = "Файл базы данных(*.dbf)|*.dbf";
	ВводФайлаКлассификатораУлиц.ПроверятьСуществованиеФайла = Истина;
	Если ВводФайлаКлассификатораУлиц.Выбрать() Тогда
		ФайлКлассификатораУлиц = ВводФайлаКлассификатораУлиц.ПолноеИмяФайла;
	КонецЕсли

КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля ввода "ФайлКлассификатораДомов".
//  
&НаКлиенте
Процедура ФайлКлассификатораДомовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ВводФайлаКлассификатораДомов = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВводФайлаКлассификатораДомов.Фильтр = "Файл базы данных(*.dbf)|*.dbf";
	ВводФайлаКлассификатораДомов.ПроверятьСуществованиеФайла = Истина;
	Если ВводФайлаКлассификатораДомов.Выбрать() Тогда
		ФайлКлассификатораДомов = ВводФайлаКлассификатораДомов.ПолноеИмяФайла;
	КонецЕсли

КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля ввода "ФайлКлассификатораСокращений".
//  
&НаКлиенте
Процедура ФайлКлассификатораСокращенийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ВводФайлаКлассификатораСокращений = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВводФайлаКлассификатораСокращений.Фильтр = "Файл базы данных(*.dbf)|*.dbf";
	ВводФайлаКлассификатораСокращений.ПроверятьСуществованиеФайла = Истина;
	Если ВводФайлаКлассификатораСокращений.Выбрать() Тогда
		ФайлКлассификатораСокращений = ВводФайлаКлассификатораСокращений.ПолноеИмяФайла;
	КонецЕсли

КонецПроцедуры
       
&НаКлиенте
Процедура Формат2003ПриИзменении(Элемент)
	УстановитьОформлениеФормы();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеОтметки(Команда)
	СписокРегионов.ЗаполнитьПометки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОтметки(Команда)
	СписокРегионов.ЗаполнитьПометки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗатенитьВсеОтметки(Команда)
	
	Для каждого Элемент Из СписокРегионов Цикл
		Элемент.Пометка = Не Элемент.Пометка;
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОчиститьКлассификатор(Команда)
	
	Ответ = Вопрос("Вся адресная информация в классификаторе по выбранным регионам будет удалена!
					|Очистить адресный классификатор по выбранным регионам?", РежимДиалогаВопрос.ДаНет);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОчиститьКлассификаторНаСервере();				
	КонецЕсли;                           
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьКлассификаторНаСервере()
	
	МенеджерЗаписи = РегистрыСведений.АдресныйКлассификатор.СоздатьМенеджерЗаписи();
	НаборЗаписей = РегистрыСведений.АдресныйКлассификатор.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КодРегионаВКоде.Использование = Истина;
	
	Для каждого Элемент Из СписокРегионов Цикл
		
		Если Элемент.Пометка Тогда
			
			// очищаем классификатор по региону
			НаборЗаписей.Отбор.КодРегионаВКоде.Значение = Элемент.Значение;
			
			АдресныеСведения = РегистрыСведений.АдресныйКлассификатор.СоздатьНаборЗаписей();
			АдресныеСведения.Отбор.КодРегионаВКоде.Использование = Истина;
			АдресныеСведения.Отбор.КодРегионаВКоде.Значение = Элемент.Значение;
			
			ТексЗапроса = 
			"ВЫБРАТЬ
			|	АдресныйКлассификатор.Код,
			|	АдресныйКлассификатор.КодРегионаВКоде,
			|	АдресныйКлассификатор.Наименование,
			|	АдресныйКлассификатор.Сокращение,
			|	АдресныйКлассификатор.Индекс,
			|	АдресныйКлассификатор.ТипАдресногоЭлемента,
			|	АдресныйКлассификатор.КодРайонаВКоде,
			|	АдресныйКлассификатор.КодГородаВКоде,
			|	АдресныйКлассификатор.КодНаселенногоПунктаВКоде,
			|	АдресныйКлассификатор.КодУлицыВКоде
			|ИЗ
			|	РегистрСведений.АдресныйКлассификатор КАК АдресныйКлассификатор
			|
			|ГДЕ
			|	АдресныйКлассификатор.КодРегионаВКоде = &КодРегионаВКоде И
			|	АдресныйКлассификатор.ТипАдресногоЭлемента = 1";
			
			Запрос = Новый Запрос(ТексЗапроса);
			Запрос.УстановитьПараметр("КодРегионаВКоде", Элемент.Значение);
			
			ВыборкаСведений = Запрос.Выполнить().Выбрать();
			
			Пока ВыборкаСведений.Следующий() Цикл
				
				ЗаписьАдреса = АдресныеСведения.Добавить();
				
				ЗаписьАдреса.Код = ВыборкаСведений.Код;
				
				ЗаписьАдреса.Наименование              = ВыборкаСведений.Наименование;
				ЗаписьАдреса.Сокращение                = ВыборкаСведений.Сокращение;
				ЗаписьАдреса.Индекс                    = ВыборкаСведений.Индекс;
				ЗаписьАдреса.ТипАдресногоЭлемента      = ВыборкаСведений.ТипАдресногоЭлемента;
				
				ЗаписьАдреса.КодРегионаВКоде           = ВыборкаСведений.КодРегионаВКоде;
				ЗаписьАдреса.КодРайонаВКоде            = ВыборкаСведений.КодРайонаВКоде;
				ЗаписьАдреса.КодГородаВКоде            = ВыборкаСведений.КодГородаВКоде;
				ЗаписьАдреса.КодНаселенногоПунктаВКоде = ВыборкаСведений.КодНаселенногоПунктаВКоде;
				ЗаписьАдреса.КодУлицыВКоде             = ВыборкаСведений.КодУлицыВКоде;
				
			КонецЦикла;
			
			АдресныеСведения.Записать(Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// очищаем классификатор от элементом с нулевым регионом
	НаборЗаписей.Отбор.КодРегионаВКоде.Значение = 0;
	НаборЗаписей.Прочитать();
	
	МенеджерЗаписи.КодРегионаВКоде = НаборЗаписей.Отбор.КодРегионаВКоде.Значение;
	
	Если НаборЗаписей.Количество() > 0 Тогда
		Для каждого ЗаписьРегистра из НаборЗаписей Цикл
			МенеджерЗаписи.Код = ЗаписьРегистра.Код;
			МенеджерЗаписи.Прочитать();
			МенеджерЗаписи.Удалить();
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дополнительно удалены некорректные записи, содержащие регион 0!");
	КонецЕсли;	
	
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАГРУЗКИ РЕГИОНОВ

// Процедура загружает регионы из внутренних таблиц.
//
// Параметры:
//  нет
//
&НаКлиенте
Процедура ЗагрузитьРегионы(Команда)
	
	ФормаИндикацииХодаЗагрузки = ПолучитьФорму("ОбщаяФорма.ХодВыполненияОбработкиДанных");
	ФормаИндикацииХодаЗагрузки.НаименованиеОбработкиДанных = "Загрузка адресной информации";
	ФормаИндикацииХодаЗагрузки.Открыть();
	ФормаИндикацииХодаЗагрузки.КомментарийОбработкиДанных = "Чтение внутренних таблиц.";
	ФормаИндикацииХодаЗагрузки.КомментарийЗначения = "Прочитано:";    
	
	КлассификаторАдресов 	= ПолучитьТаблицуРегионов();
	ВсегоЗаписей 			= КлассификаторАдресов.ВысотаТаблицы - 1;    	
	
	
	ДанныеТаблицыРегионов = Новый Массив;  	
	
	Для Сч = 2 По КлассификаторАдресов.ВысотаТаблицы Цикл

		ФормаИндикацииХодаЗагрузки.Значение = (Сч - 1) * 100 / ВсегоЗаписей;		
		
		СтруктураРегиона = Новый Структура("Код, Наименование, Сокращение, Индекс, ТипАдресногоЭлемента, КодРегионаВКоде, КодРайонаВКоде, КодГородаВКоде, КодНаселенногоПунктаВКоде, КодУлицыВКоде");		
		
		СтруктураРегиона.Код = Число(КлассификаторАдресов.Область(Сч, 1, Сч, 1).Текст);
		КодРегиона = Цел(СтруктураРегиона.Код / КонтактнаяИнформация.МаскаРегиона());
		
		СтруктураРегиона.Наименование = СокрЛП(КлассификаторАдресов.Область(Сч, 2, Сч, 2).Текст);
		СтруктураРегиона.Сокращение   = СокрЛП(КлассификаторАдресов.Область(Сч, 3, Сч, 3).Текст);
		СтруктураРегиона.Индекс       = СокрЛП(КлассификаторАдресов.Область(Сч, 4, Сч, 4).Текст);
		СтруктураРегиона.ТипАдресногоЭлемента = 1;
		
		СтруктураРегиона.КодРегионаВКоде           = КодРегиона;
		СтруктураРегиона.КодРайонаВКоде            = Цел(СтруктураРегиона.Код / КонтактнаяИнформация.МаскаРайона()) % 1000;
		СтруктураРегиона.КодГородаВКоде            = Цел(СтруктураРегиона.Код / КонтактнаяИнформация.МаскаГорода()) % 1000;
		СтруктураРегиона.КодНаселенногоПунктаВКоде = Цел(СтруктураРегиона.Код / КонтактнаяИнформация.МаскаНасПункта()) % 1000;
		СтруктураРегиона.КодУлицыВКоде             = Цел(СтруктураРегиона.Код / КонтактнаяИнформация.МаскаУлицы())% 10000;
		
		ДанныеТаблицыРегионов.Добавить(СтруктураРегиона);
		
	КонецЦикла;
	
	ФормаИндикацииХодаЗагрузки.КомментарийОбработкиДанных = "Загружаются регионы из внутренних таблиц.";
	ФормаИндикацииХодаЗагрузки.КомментарийЗначения = "Загружено:";
	
	КоличествоЗаписейКОбработке = ДанныеТаблицыРегионов.Количество() - 1;
	ШагЗагрузки = 10;
	Сч = 0;
	Пока Сч <= КоличествоЗаписейКОбработке Цикл 
		
		МаксимальноеЗначениеИтерации = Мин(Сч + ШагЗагрузки, КоличествоЗаписейКОбработке);
		
		ФормаИндикацииХодаЗагрузки.Значение = (Сч - 1) * 100 / КоличествоЗаписейКОбработке;	
		ЗагрузитьЧастьДанных(ДанныеТаблицыРегионов, Сч, МаксимальноеЗначениеИтерации);
		
	КонецЦикла;	
	
	ФормаИндикацииХодаЗагрузки.Закрыть();  	
	
	ЗаполнитьСписокРегионов();      
	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура ЗагрузитьЧастьДанных(КоллекцияЗаписей, СчетчикЭлементов, МаксимальныйНомерЭлемента)
	
	
	Пока СчетчикЭлементов <= МаксимальныйНомерЭлемента Цикл 
		
		ЭлементКоллекции = КоллекцияЗаписей[СчетчикЭлементов];
		
		ЗаписьАдреса = РегистрыСведений.АдресныйКлассификатор.СоздатьМенеджерЗаписи();	
		ЗаполнитьЗначенияСвойств(ЗаписьАдреса, ЭлементКоллекции);
		ЗаписьАдреса.Записать(Истина);
		
		СчетчикЭлементов = СчетчикЭлементов + 1;
		
	КонецЦикла;			
	
КонецПроцедуры    

&НаСервереБезКонтекста
Функция ПолучитьТаблицуРегионов()	
	Возврат РегистрыСведений.АдресныйКлассификатор.ПолучитьМакет("ТаблицаРегионов");
КонецФункции	

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАГРУЗКИ АДРЕСНОЙ ИНФОРМАЦИИ



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ СПИСКА

//  Процедура заполняет список ригионов. Список регионов используется для
//  загрузки только части классификатора
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура ЗаполнитьСписокРегионов()

	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	АдресныйКлассификатор.КодРегионаВКоде,
	|	АдресныйКлассификатор.Наименование,
	|	АдресныйКлассификатор.Сокращение
	|ИЗ
	|	РегистрСведений.АдресныйКлассификатор КАК АдресныйКлассификатор
	|
	|ГДЕ
	|	АдресныйКлассификатор.ТипАдресногоЭлемента = 1" ;

	Выборка = Запрос.Выполнить().Выбрать();
	СписокРегионов.Очистить();

	Пока Выборка.Следующий() Цикл
		СписокРегионов.Добавить(Выборка.КодРегионаВКоде, Выборка.Наименование + " " + Выборка.Сокращение, Ложь);
	КонецЦикла;
	
	СписокРегионов.СортироватьПоПредставлению();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокРегионовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокРегионовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////
// ОСНОВНЫЕ ДЕЙСТВИЯ ФОРМЫ ЗАГРУЗКА

&НаКлиенте
Функция ПолучитьДанныеФайла(ПутькФайлу)
	
	Результат = Неопределено;
	
	Файл = Новый Файл(ПутькФайлу);	
	Если Файл.Существует() Тогда 
		Результат = Новый Структура("ИмяФайла, ДанныеФайла", Файл.Имя, Новый ДвоичныеДанные(ПутькФайлу));	
	КонецЕсли;  
	
	Возврат Результат;
	
КонецФункции	

// Процедура - обработчик события "Загрузить" командной панели "ДействияФормы".
//
&НаКлиенте
Процедура Загрузить(Команда)	
	
	ТолькоАдресныеСокращения = ПустаяСтрока(ФайлАдресногоКлассификатора)
	                         И ПустаяСтрока(ФайлКлассификатораУлиц)
	                         И (Формат2003 И ПустаяСтрока(ФайлКлассификатораДомов));
	
	ИспользуемыеРегионы = Новый Массив;
	Для каждого Элемент Из СписокРегионов Цикл
		Если Элемент.Пометка Тогда 
			ИспользуемыеРегионы.Добавить(Элемент.Значение);	
		КонецЕсли;	
	КонецЦикла;
	
	Если ИспользуемыеРегионы.Количество() = 0 И Не ТолькоАдресныеСокращения Тогда 
		Предупреждение("Необходимо отметить хотя бы один регион для загрузки");
		Возврат;
	КонецЕсли;	
							 
	АдресАдресногоКлассификатора 	= ПолучитьДанныеФайла(ФайлАдресногоКлассификатора);
	АдресКлассификатораУлиц 		= ПолучитьДанныеФайла(ФайлКлассификатораУлиц);
	АдресКлассификатораДомов 		= ПолучитьДанныеФайла(ФайлКлассификатораДомов);
	АдресКлассификатораСокращений 	= ПолучитьДанныеФайла(ФайлКлассификатораСокращений);
	ФайлыКлассификатора = Новый Структура("АдресАдресногоКлассификатора, АдресКлассификатораУлиц, АдресКлассификатораДомов, АдресКлассификатораСокращений",
												АдресАдресногоКлассификатора, АдресКлассификатораУлиц, АдресКлассификатораДомов, АдресКлассификатораСокращений);
		   		  		
	ПараметрыВыполненияОперации = Новый Структура;	
	ПараметрыВыполненияОперации.Вставить("ТолькоАдресныеСокращения", 	ТолькоАдресныеСокращения);
	ПараметрыВыполненияОперации.Вставить("ФайлыКлассификатора", 		ФайлыКлассификатора);
	ПараметрыВыполненияОперации.Вставить("ИспользуемыеРегионы", 		ИспользуемыеРегионы);
	ПараметрыВыполненияОперации.Вставить("Формат2003", 					Формат2003);
	ПараметрыВыполненияОперации.Вставить("КодировкаWindows",			КодировкаWindows);	
                  	
	ЗагрузитьКлассификаторыНаСервере(ПараметрыВыполненияОперации);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьКлассификаторыНаСервере(ПараметрыОперации)
	
	РегистрыСведений.АдресныйКлассификатор.ВыполнитьЗагрузкуКлассификатора(ПараметрыОперации);
	
КонецПроцедуры
